In [8]:
import pandas as pd
import numpy as np
a = np.array([["Ivan", '17', '11П', "football"], ["Menya", '16', '11М', "hockey"]])
df = pd.DataFrame(a, columns=['name', 'age', 'class', 'hobbie'])
df

    name age class    hobbie
0   Ivan  17   11П  football
1  Menya  16   11М    hockey

In [7]:
df.drop(['hobbie'], axis = 1)

    name age class
0   Ivan  17   11П
1  Menya  16   11М